app/Controllers/AdminController.php

    public function users()
    {
        $userModel = new UserModel();
        $data['users'] = $userModel->findAll();
---
SELECT *
FROM `users`

    public function messages()
    {
        $messageModel = new MessageModel();
        $data['messages'] = $messageModel->findAll();
---
SELECT *
FROM `messages`

    public function editUser($id)
    {
        $userModel = new UserModel();

        // Kullanıcıyı ID'ye göre al
        $user = $userModel->find($id);
---
SELECT *
FROM `users`
WHERE `users`.`id` = '29'