app/Controllers/AuthController.php

    public function login_process()
    {
        $email = $this->request->getPost('email');
        $password = $this->request->getPost('password');

        $model = new UserModel();
        $user = $model->where('email', $email)->first();
---
SELECT *
FROM `users`
WHERE `email` = 'benadminim@gmail.com'
 LIMIT 1